results/factorial-final/security-overhead-final-mtls-broker5/security-overhead-final-factorial-mtls-b5-rf5-isr4-msg10240-tps1000-batch131072-acks1-prod1-compnone-trial1/producer-perf-1.log
producer_index=1
producer_count=1
producer_records=100000
producer_throughput=1000
4996 records sent, 998.8 records/sec (9.75 MB/sec), 215.2 ms avg latency, 1276.0 ms max latency.
5003 records sent, 1000.4 records/sec (9.77 MB/sec), 4.9 ms avg latency, 27.0 ms max latency.
5005 records sent, 1000.4 records/sec (9.77 MB/sec), 4.6 ms avg latency, 24.0 ms max latency.
5000 records sent, 1000.0 records/sec (9.77 MB/sec), 4.7 ms avg latency, 27.0 ms max latency.
5000 records sent, 999.0 records/sec (9.76 MB/sec), 4.5 ms avg latency, 19.0 ms max latency.
5007 records sent, 1001.4 records/sec (9.78 MB/sec), 4.6 ms avg latency, 40.0 ms max latency.
5001 records sent, 1000.0 records/sec (9.77 MB/sec), 5.0 ms avg latency, 32.0 ms max latency.
5002 records sent, 1000.2 records/sec (9.77 MB/sec), 4.5 ms avg latency, 16.0 ms max latency.
5007 records sent, 1000.2 records/sec (9.77 MB/sec), 4.4 ms avg latency, 19.0 ms max latency.
5006 records sent, 1000.2 records/sec (9.77 MB/sec), 4.4 ms avg latency, 21.0 ms max latency.
5002 records sent, 1000.0 records/sec (9.77 MB/sec), 5.4 ms avg latency, 63.0 ms max latency.
5006 records sent, 1000.0 records/sec (9.77 MB/sec), 4.5 ms avg latency, 35.0 ms max latency.
5002 records sent, 1000.4 records/sec (9.77 MB/sec), 4.5 ms avg latency, 35.0 ms max latency.
5003 records sent, 999.8 records/sec (9.76 MB/sec), 4.4 ms avg latency, 18.0 ms max latency.
5007 records sent, 1000.6 records/sec (9.77 MB/sec), 4.3 ms avg latency, 13.0 ms max latency.
5005 records sent, 1000.2 records/sec (9.77 MB/sec), 4.4 ms avg latency, 25.0 ms max latency.
5001 records sent, 1000.0 records/sec (9.77 MB/sec), 4.4 ms avg latency, 28.0 ms max latency.
4998 records sent, 999.6 records/sec (9.76 MB/sec), 4.8 ms avg latency, 53.0 ms max latency.
5007 records sent, 1000.8 records/sec (9.77 MB/sec), 4.7 ms avg latency, 15.0 ms max latency.
100000 records sent, 999.540212 records/sec (9.76 MB/sec), 15.14 ms avg latency, 1276.00 ms max latency, 4 ms 50th, 8 ms 95th, 536 ms 99th, 847 ms 99.9th.